$(function () {
    //初始化份菜单
    var prov = new Array();
    prov[1] = "北京";
    prov[2] = "天津";
    prov[3] = "上海";
    prov[4] = "重庆";
    prov[5] = "河北";
    prov[6] = "山西";
    prov[7] = "台湾";
    prov[8] = "辽宁";
    prov[9] = "吉林";
    prov[10] = "黑龙江";
    prov[11] = "江苏";
    prov[12] = "浙江";
    prov[13] = "安徽";
    prov[14] = "福建";
    prov[15] = "江西";
    prov[16] = "山东";
    prov[17] = "河南";
    prov[18] = "湖北";
    prov[19] = "湖南";
    prov[20] = "广东";
    prov[21] = "甘肃";
    prov[22] = "四川";
    prov[23] = "贵州";
    prov[24] = "海南";
    prov[25] = "云南";
    prov[26] = "青海";
    prov[27] = "陕西";
    prov[28] = "广西";
    prov[29] = "西藏";
    prov[30] = "宁夏";
    prov[31] = "新疆";
    prov[32] = "内蒙古";
    prov[33] = "澳门";
    prov[34] = "香港";
    

 		for (var i = 1; i < prov.length; i++) {
				 var selectProv = $("#selectProv");
			    	if(selectProv.attr('data-default')==prov[i]){
			    		selectProv.append("<option value=\""+prov[i]+"\" selected=\"selected\">"+prov[i]+"</option>");
			    	}else{
			    		selectProv.append("<option value=\""+prov[i]+"\">"+prov[i]+"</option>");
			    	}
				}
				
    var city = new Array();
    city[1] = new Array("北京");
    city[2] = new Array("天津");
    city[3] = new Array("上海");
    city[4] = new Array("重庆");
    city[5] = new Array("石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水");
    city[6] = new Array("太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁" );
    city[7] = new Array("台湾");
    city[8] = new Array("沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦","铁岭", "朝阳", "葫芦岛");
    city[9] = new Array("长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边");
    city[10] = new Array("哈尔滨", "齐齐哈尔", "鹤岗", "双鸭山", "鸡西", "大庆", "伊春", "牡丹江", "佳木斯", "七台河","黑河", "绥化", "大兴安岭地区");
    city[11] = new Array("南京", "苏州", "无锡", "常州", "镇江", "南通", "泰州", "扬州", "盐城", "连云港", "徐州","淮安", "宿迁");
    city[12] = new Array("杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水");
    city[13] = new Array("合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "阜阳","宿州", "巢湖", "六安", "亳州", "池州", "宣城");
    city[14] = new Array("福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德");
    city[15] = new Array("南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶");
    city[16] = new Array("济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照","莱芜", "临沂", "德州", "聊城", "滨州", "菏泽");
    city[17] = new Array("郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河","三门峡", "南阳", "商丘", "信阳", "周口", "驻马店");
    city[18] = new Array("武汉", "黄石", "十堰", "荆州", "宜昌", "襄阳", "鄂州", "荆门", "孝感", "黄冈", "咸宁","随州","潜江","恩施","神农架林区","天门","仙桃");
    city[19] = new Array("长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州","怀化", "娄底", "湘西州");
    city[20] = new Array("广州", "深圳", "珠海", "汕头", "韶关", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州","梅州", "汕尾", "河源", "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮");
    city[21] = new Array("兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "酒泉", "张掖", "庆阳", "平凉", "定西","陇南", "临夏州", "甘南州");
    city[22] = new Array("成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充","眉山", "宜宾", "广安", "达州", "雅安", "巴中", "资阳", "阿坝州", "甘孜州", "凉山州");
    city[23] = new Array("贵阳", "六盘水", "遵义", "安顺", "铜仁地区", "毕节地区", "黔西南州", "黔东南州", "黔南州" );
    city[24] = new Array("海口", "三亚","白沙","保亭","昌江","儋州","澄迈","东方","定安","琼海","琼中","乐东","临高","陵水","屯昌","万宁","文昌","五指山");
    city[25] = new Array("昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "德宏州", "怒江州", "迪庆州","大理州", "楚雄州", "红河州", "文山", "西双版纳");
    city[26] = new Array("西宁", "海东地区", "海北州", "海南州", "黄南州", "果洛州", "玉树州", "海西州");
    city[27] = new Array("西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛");
    city[28] = new Array("南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州","河池", "来宾", "崇左");
    city[29] = new Array("拉萨", "那曲地区", "昌都地区", "林芝地区", "山南地区", "日喀则地区", "阿里地区");
    city[30] = new Array("银川", "石嘴山", "吴忠", "固原", "中卫");
    city[31] = new Array("乌鲁木齐", "克拉玛依", "吐鲁番地区", "哈密地区", "和田地区", "阿克苏地区", "喀什地区", "克孜勒苏","阿拉尔","巴音郭楞", "昌吉州", "博尔塔拉州", "伊犁州", "塔城地区", "阿勒泰地区","石河子","图木舒克","五家渠");
    city[32] = new Array("呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布","锡林郭勒盟", "兴安盟", "阿拉善盟");
    city[33] = new Array("澳门");
    city[34] = new Array("香港");

    
		$("#selectProv").change(function() {
		 			var indexProv = $("#selectProv>option:selected").index();
					var cities = city[indexProv+1];
					$("#selectCity").empty();
					var deaultValue = $("#selectCity").attr('data-default');
					for (var i = 0; i < cities.length; i++) {
						$option = $("<option/>")
						$option.attr("value", cities[i]);
						$option.text(cities[i]);
						if(cities[i]==deaultValue){
							$option.attr("selected", "selected");
						}
						$("#selectCity").append($option);
					}
			 });
			$("#selectProv").change();

    $("#selectCity").on("change",function(){
        console.log( $("#selectProv>option:selected").val() + $("#selectCity>option:selected").val() );
    });

});